<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"fb2fe2de6d51879dc7eb7d8c92c94b9fe8ab9282052f484d365081995ba13421","plan_job_ref":"Job Create terraform plan #56 at https://github.com/presentium/infrastructure/actions/runs/10521507855","plan_out_hash":"ceafb87f12d5a3aa88eeafd35d037856a713461a83cc97cca5c1aedaccae1553","plan_hash":"4bbbfc7b195b028f6e17f0310b0540ce0049f7bcbbadb3f056f42f9e1338291e","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.eks.aws_iam_policy.vault_policy will be created
+   resource "aws_iam_policy" "vault_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Provides permissions to use KMS for Vault"
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = "presentium-vault-policy-"
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "kms:Encrypt",
+                           "kms:DescribeKey",
+                           "kms:Decrypt",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "AllowKeyUsage"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = {
+           "Terraform" = "true"
        }
    }

  # module.eks.module.kms-vault.aws_kms_alias.this["presentium/vault"] will be created
+   resource "aws_kms_alias" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/presentium/vault"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = (known after apply)
    }

  # module.eks.module.kms-vault.aws_kms_key.this[0] will be created
+   resource "aws_kms_key" "this" {
+       arn                                = (known after apply)
+       bypass_policy_lockout_safety_check = false
+       customer_master_key_spec           = "*****************"
+       deletion_window_in_days            = 7
+       description                        = "KMS key for Vault"
+       enable_key_rotation                = true
+       id                                 = (known after apply)
+       is_enabled                         = true
+       key_id                             = (known after apply)
+       key_usage                          = "ENCRYPT_DECRYPT"
+       multi_region                       = false
+       policy                             = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "kms:*"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::123247571664:root"
                        }
+                       Resource  = "*"
+                       Sid       = "Default"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       rotation_period_in_days            = (known after apply)
+       tags_all                           = {
+           "Terraform" = "true"
        }
    }

  # module.eks.module.vault_kms_irsa.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:aud" = "*****************"
+                               "oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6:sub" = "***********************************************"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::123247571664:oidc-provider/oidc.eks.eu-west-1.amazonaws.com/id/7D237BCA403531BC4EAC898802E8C3E6"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "PRES-VAULT-KMS-PRESENTIUM"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = {
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.eks.module.vault_kms_irsa.aws_iam_role_policy_attachment.this["vault"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "PRES-VAULT-KMS-PRESENTIUM"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #56](https://github.com/presentium/infrastructure/actions/runs/10521507855)